"""

Домашнее задание №1

Цикл while: ask_user со словарём

* Создайте словарь типа "вопрос": "ответ", например:
  {"Как дела": "Хорошо!", "Что делаешь?": "Программирую"} и так далее
* Напишите функцию ask_user() которая с помощью функции input()
  просит пользователя ввести вопрос, а затем, если вопрос есть
  в словаре, программа давала ему соотвествующий ответ. Например:

    Пользователь: Что делаешь?
    Программа: Программирую
    
"""

questions_and_answers = {"Как тебя зовут?": "Питон", "Сколько тебе лет?": 32, "Как дела?": "Хорошо", "Что делаешь?": "Работаю", "Кто твой папа?": "Гвидо ван Россум"}

def ask_user(answers_dict):
    question = input("Пользователь: ")

    if question in answers_dict:
        answer = answers_dict[question]
        print(f'Программа: {answer}')    
    
if __name__ == "__main__":
    while True:
        ask_user(questions_and_answers)